In [1]:
import pandas as pd
import numpy as np

In [3]:
#Answer1
data ={
   'Name':['Alice','Bob','Charlie','dave'],
    'Age':[25,-1,30,-99999],
    'Salary':[50000,60000,-99999,70000]
}

In [5]:
df = pd.DataFrame(data)

In [7]:
df

      Name    Age  Salary
0    Alice     25   50000
1      Bob     -1   60000
2  Charlie     30  -99999
3     dave -99999   70000

In [15]:
df = df.replace([-1 ,-99999], np.NaN)

In [17]:
df

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  30.0      NaN
3     dave   NaN  70000.0

In [45]:
#Answer2
data ={
   'Name':['Alice','Bob','Charlie','dave'],
    'Age':[25,-1,30,-99999],
    'Salary':[50000,60000,-99999,70000]
}

In [47]:
df = pd.DataFrame(data)

In [49]:
df

      Name    Age  Salary
0    Alice     25   50000
1      Bob     -1   60000
2  Charlie     30  -99999
3     dave -99999   70000

In [55]:
df = df.replace({'Age':-99999}, value=np.NaN)
df = df.replace({'Salary':-99999}, 0)

In [57]:
df

      Name   Age  Salary
0    Alice  25.0   50000
1      Bob  -1.0   60000
2  Charlie  30.0       0
3     dave   NaN   70000

In [65]:
#Answer3
data = {
    'Product':['A','B','C','D'],
    'Price':[100,200,300,400],
    'Discount':['n.a','not available','10%','n.a']
}

In [67]:
df = pd.DataFrame(data)
df

  Product  Price       Discount
0       A    100            n.a
1       B    200  not available
2       C    300            10%
3       D    400            n.a

In [69]:
df = df.replace(['n.a','not available','n.a'], 0)

In [71]:
df

  Product  Price Discount
0       A    100        0
1       B    200        0
2       C    300      10%
3       D    400        0

In [151]:
#Answer4
data = {
       'Contact us at':['info@example.com'],
       'Support':['support@test.com'],
       'Feedback':['feedback@demo.com']
   }

In [153]:
df = pd.DataFrame(data)

In [155]:
df

      Contact us at           Support           Feedback
0  info@example.com  support@test.com  feedback@demo.com

In [157]:
df = df.replace({'Contact us at': r'@.*\.'}, '@newdomain.', regex=True)
df = df.replace({'Support': r'@.*\.'}, '@newdomain.', regex=True)
df = df.replace({'Feedback': r'@.*\.'}, '@newdomain.', regex=True)

In [159]:
df

        Contact us at                Support                Feedback
0  info@newdomain.com  support@newdomain.com  feedback@newdomain.com

In [171]:
#Answer5
data = {
    'Catagorey':['A','B','C','D'],
    'Value':[10,20,30,40]
}

In [173]:
df = pd.DataFrame(data)

In [175]:
df

  Catagorey  Value
0         A     10
1         B     20
2         C     30
3         D     40

In [179]:
df = df.replace([10,20],[100,200])

In [182]:
df

  Catagorey  Value
0         A    100
1         B    200
2         C     30
3         D     40

In [184]:
#Answer6
data = {
     'Name':['Alice','Bob','Charlie','dave'],
    'Score':[85,45,90,50]
}

In [186]:
df = pd.DataFrame(data)

In [188]:
df

      Name  Score
0    Alice     85
1      Bob     45
2  Charlie     90
3     dave     50

In [190]:
df = df['Score'].apply(lambda x: 'Pass' if x>=50 else 'Fail')

In [192]:
df

0    Pass
1    Fail
2    Pass
3    Pass
Name: Score, dtype: object

In [212]:
#Answer7
data = {
    'Grade':['A','B','C','D','F']
}

In [214]:
df = pd.DataFrame(data)

In [216]:
df

  Grade
0     A
1     B
2     C
3     D
4     F

In [224]:
df = df.replace(['A','B','C','D','F'],['Excellent','Good','Average','Poor','Fail'])

In [226]:
df

       Grade
0  Excellent
1       Good
2    Average
3       Poor
4       Fail